// ==================================
// PLCcloud - datamodel - vrgpiomodel
// --------------------------------------------------------------
// 仮想GPIOの処理の核となる
// 構造体, グローバル変数
// の置き所
// ==================================

//
// 構造体一覧
//
/*
===================================
　構造体一覧
　--------------------------------------------------------------

　- 仮想GPIOマッピング構造体

===================================
*/

//
// 仮想GPIOマッピング構造体
//
/*
===================================
　仮想GPIOマッピング構造体
　--------------------------------------------------------------

　・vrgpioMap
　＜フィールド＞
　　- gpio2 : vrgpio
　　- gpio3 : vrgpio
　　　　　・
　　　　　・
　　　　　・
　　- gpio33 : vrgpio

　・vrgpio構造体
　＜フィールド＞
　　- gpioMode > 入出力モード
　　- gpioState > 今のgpioの状態

===================================
*/

package vrgpiomodel