// ===========================================================
// PLCcloud - processing - gpiooperation - virtualgpio
// -----------------------------------------------------------
// gpioの状態を管理する仮想gpioの実装
// 実態を伴うgpioの制御がobserver(仮想gpioを見る)の機能を持つ
// ===========================================================

//
// virtual gpio
//
/*
==============================================================
・仮想gpioの実装を行う
　------------------------------------------------------------

実装機能
- 仮想gpioを生成する関数
- 仮想gpioへ外部からアクセスするAPI

==============================================================
*/

package virtualgpio