// ==================================
// PLCcloud - processing - plclog
// --------------------------------------------------------------
// コンソール上にフォーマットしたログを表示する
// サーバーへ送る動作ログのjson化
// これらを行う関数のパッケージ
// ==================================

//
// 取得可能ログ一覧
//
/*
===================================
　取得可能ログ一覧
　--------------------------------------------------------------

　※補足
　　サーバーへログを送る機能
　　> sendlog パッケージ
　　コンソール上でデバッグ用にログを表示する
　　> debuglog パッケージ

===================================
*/

package plclog